PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

int writesettings(int slot)
{
	FLASH_EraseInitTypeDef ferase;
	uint32_t serror;
	uint32_t sz;
	struct settings sts;
	uint32_t *pt;
	uint32_t addr;
	int j;

	__disable_irq();
	HAL_FLASH_Unlock();

	ferase.TypeErase = FLASH_TYPEERASE_SECTORS;
	ferase.NbSectors = 1;
	ferase.Sector = FLASH_SECTOR_5;
	ferase.VoltageRange = VOLTAGE_RANGE_3;
	HAL_FLASHEx_Erase(&ferase, &serror);

	sz = sizeof(struct settings);
	sts.mx0 = mx0;		sts.my0 = my0;		sts.mz0 = mz0;
	sts.mxscale = mxscale;	sts.myscale = myscale;	sts.mzscale = mzscale;
	sts.gx0 = gx0;		sts.gy0 = gy0;		sts.gz0 = gz0;
	sts.roll0 = roll0;	sts.pitch0 = pitch0;	sts.yaw0 = yaw0;

	sts.tcoef = tcoef;	sts.ttcoef = ttcoef;	sts.ptcoef = ptcoef;

	sts.speedpid = speedpid;
	sts.yawspeedpid = yawspeedpid;

	sts.p = p;		sts.i = i;		sts.d = d;
	sts.sp = sp;		sts.si = si;		sts.sd = sd;
	sts.yp = yp;		sts.yi = yi;		sts.yd = yd;
	sts.ysp = ysp;		sts.ysi = ysi;		sts.ysd = ysd;
	sts.zsp = zsp;		sts.zsi = zsi;		sts.zsd = zsd;

	pt = (uint32_t *) &sts;

	addr = USER_FLASH + sizeof(struct settings) * slot;
	for (j = 0; j < sz / 4; ++j) {
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, pt[j]);
		addr += 4;
	}

	HAL_FLASH_Lock();
	__enable_irq();

	return 0;
}

int readsettings(int slot)
{
	__IO struct settings *sts;

	sts = (__IO struct settings *) USER_FLASH + slot;
	
	mx0 = sts->mx0;	
	my0 = sts->my0;
	mz0 = sts->mz0;
	mxscale = sts->mxscale;
	myscale = sts->myscale;
	mzscale = sts->mzscale;

	gx0 = sts->gx0;
	gy0 = sts->gy0;
	gz0 = sts->gz0;
	roll0 = sts->roll0;
	pitch0 = sts->pitch0;
	yaw0 = sts->yaw0;

	tcoef = sts->tcoef;
	ttcoef = sts->ttcoef;
	ptcoef = sts->ptcoef;

	speedpid = sts->speedpid;
	yawspeedpid = sts->yawspeedpid;

	p = sts->p;		i = sts->i;		d = sts->d;
	sp = sts->sp;		si = sts->si;		sd = sts->sd;
	yp = sts->yp;		yi = sts->yi;		yd = sts->yd;
	ysp = sts->ysp;		ysi = sts->ysi;		ysd = sts->ysd;
	zsp = sts->zsp;		zsi = sts->zsi;		zsd = sts->zsd;

	return 0;
}

int initstabilize(float alt)
{
	float ax, ay, az;

	alt0 = alt;

	if (dev[BMP_DEV].status == DEVSTATUS_INIT)
		press0 = groundpressure(alt);

	averageposition(&ax, &ay, &az, &gx0, &gy0, &gz0);

	dsp_initcompl(&pitchcompl, tcoef, PID_FREQ);
	dsp_initcompl(&rollcompl, tcoef, PID_FREQ);

	dsp_initpidval(&pitchpv, p, i, d, 0.0);
	dsp_initpidval(&rollpv, p, i, d, 0.0);

	dsp_initpidval(&pitchspv, sp, si, sd, 0.0);
	dsp_initpidval(&rollspv, sp, si, sd, 0.0);
	dsp_initpidval(&yawspv, ysp, ysi, ysd, 0.0);
	dsp_initpidval(&yawpv, yp, yi, yd, 0.0);
	dsp_initpidval(&tpv, zsp, zsi, zsd, 0.0);

	dsp_initlpf(&presslpf, ptcoef, PID_FREQ);
	dsp_initlpf(&tlpf, ttcoef, PID_FREQ);

	return 0;
}

int stabilize(float dt)
{
	struct bmp_data bd;
	struct mpu_data md;
	struct hmc_data hd;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float gy, gx, gz;

	dt = (dt < 0.000001) ? 0.000001 : dt;

	if (dev[BMP_DEV].status == DEVSTATUS_INIT) {
		dev[BMP_DEV].read(dev[BMP_DEV].priv, 0, &bd,
			sizeof(struct bmp_data));

		dsp_updatelpf(&presslpf, bd.press);
	}

	dev[MPU_DEV].read(dev[MPU_DEV].priv, 0, &md,
		sizeof(struct mpu_data));
	
	dsp_updatelpf(&tlpf, md.afz);

	gy = deg2rad((md.gfy - gy0));
	gx = deg2rad((md.gfx - gx0));
	gz = deg2rad((md.gfz - gz0));

	roll = dsp_updatecompl(&rollcompl, gy * dt,
		atan2f(-md.afx,
		sqrt(md.afy * md.afy + md.afz * md.afz))) - roll0;

	pitch = dsp_updatecompl(&pitchcompl, gx * dt,
		atan2f(md.afy,
		sqrt(md.afx * md.afx + md.afz * md.afz))) - pitch0;

	dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
		sizeof(struct hmc_data));

	yaw = circf(hmc_heading(pitch, roll, hd.fx, hd.fy, hd.fz)
		- yaw0);

	if (speedpid) {
		rollcor = dsp_pid(&rollspv, rolltarget, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchtarget, gx, dt);
	}
	else {
		rollcor = dsp_pid(&rollpv, rolltarget, roll, dt);
		pitchcor = dsp_pid(&pitchpv, pitchtarget, pitch, dt);

		rollcor = dsp_pid(&rollspv, rollcor, gy, dt);
		pitchcor = dsp_pid(&pitchspv, pitchcor, gx, dt);
	}

	if (yawspeedpid)
		yawcor = dsp_pid(&yawspv, yawtarget, gz, dt);
	else {
		yawcor = circf(dsp_pid(&yawpv, yawtarget, yaw, dt));
		yawcor = dsp_pid(&yawspv, yawcor, gz, dt);
	}

	thrustcor = dsp_pid(&tpv, thrust + 1.0, dsp_getlpf(&tlpf), dt);

	setthrust(ltw * (thrustcor + 0.5 * rollcor
			+ 0.5 * pitchcor - 0.5 * yawcor),
		rtw * (thrustcor - 0.5 * rollcor
			+ 0.5 * pitchcor + 0.5 * yawcor),
		rbw * (thrustcor - 0.5 * rollcor
			- 0.5 * pitchcor - 0.5 * yawcor),
		lbw * (thrustcor + 0.5 * rollcor
			- 0.5 * pitchcor + 0.5 * yawcor));

	return 0;
}

int parsecommand(char **toks, int maxtoks, char *data)
{
	int i;

	for (i = 0; i < maxtoks; ++i)
		toks[i] = "";

	i = 0;

	toks[i++] = strtok((char *) data, " ");

	while (i < maxtoks && (toks[i++] = strtok(NULL, " ")) != NULL);

	return (i - 1);
}

int controlcmd(char *cmd)
{
	char s[INFOLEN];
	char *toks[12];

	if (cmd[0] == '\0')
		return 0;

	parsecommand(toks, 12, cmd);

	if (strcmp(toks[0], "beep") == 0)
		wifitimeout = WIFI_TIMEOUT;
	else if (strcmp(toks[0], "md") == 0) {
		struct mpu_data md;
		struct hmc_data hd;

		dev[MPU_DEV].read(dev[MPU_DEV].priv, 0, &md,
			sizeof(struct mpu_data));

		dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
			sizeof(struct hmc_data));
	
		snprintf(s, INFOLEN,
			"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r",
			"accel: ", (double) md.afx, (double) md.afy,
			(double) md.afz);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%-7sx = %0.3f; y = %0.3f; z = %0.3f\n\r",
			"gyro: ", (double) deg2rad(md.gfx),
			(double) deg2rad(md.gfy),
			(double) deg2rad(md.gfz));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"roll: %0.3f; pitch: %0.3f; yaw: %0.3f\n\r",
			(double) (dsp_getcompl(&rollcompl) - roll0),
			(double) (dsp_getcompl(&pitchcompl) - pitch0),
			(double) circf(hmc_heading(
				dsp_getcompl(&pitchcompl) - pitch0,
				dsp_getcompl(&rollcompl) - roll0,
				hd.fx, hd.fy, hd.fz) - yaw0));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"z acceleration: %f\r\n",
			(double) dsp_getlpf(&tlpf));

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"battery: %0.3f\n\r",
			getadcv(&hadc1) / (double) 0xfff * (double) 6.6);

		esp_send(&espdev, s);
	}
	else if (strcmp(toks[0], "hd") == 0) {
		struct hmc_data hd;

		dev[HMC_DEV].read(dev[HMC_DEV].priv, 0, &hd,
			sizeof(struct hmc_data));
	
		snprintf(s, INFOLEN,
			"x = %0.3f; y = %0.3f; z = %0.3f\n\r",
			(double) hd.fx, (double) hd.fy,
			(double) hd.fz);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"heading: %f\r\n", (double) hmc_heading(
				dsp_getcompl(&pitchcompl) - pitch0,
				dsp_getcompl(&rollcompl) - roll0,
				hd.fx, hd.fy, hd.fz));
	
		esp_send(&espdev, s);
	}
	else if (strcmp(toks[0], "bd") == 0) {
		float press;

		press = dsp_getlpf(&presslpf);

