PinkFluffyUnic0rn/stm32flight/main.c
		snprintf(s, INFOLEN, "bar: %f; alt: %f\r\n",
			(double) press, (double) getalt(press0, press));
		
		esp_send(&espdev, s);
	}
	else if (strcmp(toks[0], "vd") == 0) {
		snprintf(s, INFOLEN,
			"t: %.3f; r: %.3f; p: %.3f; y: %.3f\r\n",
			(double) thrust, (double) rolltarget,
			(double) pitchtarget, (double) yawtarget);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"mag off: %.3f; %.3f; %.3f\r\n",
			(double) mx0, (double) my0, (double) mz0);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"mag scale: %.3f; %.3f; %.3f\r\n",
			(double) mxscale, (double) myscale,
			(double) mzscale);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"gyro cor: %.3f; %.3f; %.3f\r\n",
			(double) gx0, (double) gy0, (double) gz0);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"roll cor: %.3f; pitch cor: %.3f; yaw cor: %.3f\r\n",
			(double) roll0, (double) pitch0, (double) yaw0);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"lbw: %0.1f; rbw: %0.1f; ltw: %0.1f; rtw: %0.1f\r\n",
			(double) lbw, (double) rbw,
			(double) ltw, (double) rtw);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"cf: %.6f\r\n", (double) tcoef);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"accel cf: %.6f\r\n", (double) ttcoef);
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"pressure cf: %.6f\r\n",
			(double) ptcoef);
		
		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"loops count: %d\r\n", loopscount);

		esp_send(&espdev, s);
	}
	else if (strcmp(toks[0], "pd") == 0) {
		snprintf(s, INFOLEN, "pos PID: %.3f,%.3f,%.3f\r\n",
			(double) p, (double) i, (double) d);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"speed PID: %.3f,%.3f,%.3f\r\n",
			(double) sp, (double) si, (double) sd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"yaw PID: %.3f,%.3f,%.3f\r\n",
			(double) yp, (double) yi, (double) yd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"yaw speed PID: %.3f,%.3f,%.3f\r\n",
			(double) ysp, (double) ysi, (double) ysd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"thrust PID: %.3f,%.3f,%.3f\r\n",
			(double) zsp, (double) zsi, (double) zsd);

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%s mode\r\n", speedpid ? "single" : "dual");

		snprintf(s + strlen(s), INFOLEN - strlen(s),
			"%s yaw mode\r\n",
			yawspeedpid ? "single" : "dual");

		esp_send(&espdev, s);
	}
	else if (strcmp(toks[0], "r") == 0)
		lbw = rbw = ltw = rtw = 0.0;
	else if (strcmp(toks[0], "e") == 0)
		lbw = rbw = ltw = rtw = 1.0;
	else if (strcmp(toks[0], "c") == 0)
		initstabilize(atof(toks[1]));
	else if (strcmp(toks[0], "t") == 0) {
		float v;
	
		v = atof(toks[2]);
		
		if (strcmp(toks[1], "c") == 0)		thrust = v;
		else if (strcmp(toks[1], "r") == 0)	rolltarget = v;
		else if (strcmp(toks[1], "p") == 0)	pitchtarget = v;
		else if (strcmp(toks[1], "y") == 0)	yawtarget = v;
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "flash") == 0) {
		if (strcmp(toks[1], "write") == 0)
			writesettings(atoi(toks[2]));	
		else if (strcmp(toks[1], "read") == 0)
			readsettings(atoi(toks[2]));
	}
	else if (strcmp(toks[0], "pid") == 0) {
		float v;
	
		v = atof(toks[3]);
		
		if (strcmp(toks[1], "tilt") == 0) {
			if (strcmp(toks[2], "mode") == 0) {
				if (strcmp(toks[3], "double") == 0)
					speedpid = 0;
				else if (strcmp(toks[3], "single") == 0)
					speedpid = 1;
				else
					goto unknown;
			}
			else if (strcmp(toks[2], "p") == 0)	p = v;
			else if (strcmp(toks[2], "i") == 0)	i = v;
			else if (strcmp(toks[2], "d") == 0)	d = v;
			else
				goto unknown;
	
			dsp_setpid(&pitchpv, p, i, d);
			dsp_setpid(&rollpv, p, i, d);
		}
		else if (strcmp(toks[1], "stilt") == 0) {
			if (strcmp(toks[2], "p") == 0)		sp = v;
			else if (strcmp(toks[2], "i") == 0)	si = v;
			else if (strcmp(toks[2], "d") == 0)	sd = v;
			else
				goto unknown;

			dsp_setpid(&pitchspv, sp, si, sd);
			dsp_setpid(&rollspv, sp, si, sd);
		}
		else if (strcmp(toks[1], "yaw") == 0) {
			if (strcmp(toks[2], "mode") == 0) {
				if (strcmp(toks[3], "double") == 0)
					yawspeedpid = 0;
				else if (strcmp(toks[3], "single") == 0)
					yawspeedpid = 1;
				else
					goto unknown;
			}
			else if (strcmp(toks[2], "p") == 0)	yp = v;
			else if (strcmp(toks[2], "i") == 0)	yi = v;
			else if (strcmp(toks[2], "d") == 0)	yd = v;
			else
				goto unknown;
		
			dsp_setpid(&yawpv, yp, yi, yd);
		}
		else if (strcmp(toks[1], "syaw") == 0) {
			if (strcmp(toks[2], "p") == 0)		ysp = v;
			else if (strcmp(toks[2], "i") == 0)	ysi = v;
			else if (strcmp(toks[2], "d") == 0)	ysd = v;
			else
				goto unknown;
		
			dsp_setpid(&yawspv, ysp, ysi, ysd);
		}
		else if (strcmp(toks[1], "climb") == 0) {
			if (strcmp(toks[2], "p") == 0)		zsp = v;
			else if (strcmp(toks[2], "i") == 0)	zsi = v;
			else if (strcmp(toks[2], "d") == 0)	zsd = v;
			else
				goto unknown;

			dsp_setpid(&tpv, zsp, zsi, zsd);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "compl") == 0) {
		tcoef = atof(toks[1]);
		
		dsp_initcompl(&pitchcompl, tcoef, PID_FREQ);
		dsp_initcompl(&rollcompl, tcoef, PID_FREQ);	
	}
	else if (strcmp(toks[0], "lpf") == 0) {
		if (strcmp(toks[1], "climb") == 0) {
			ttcoef = atof(toks[2]);
			
			dsp_initlpf(&tlpf, ttcoef, PID_FREQ);
		}
		else if (strcmp(toks[1], "pressure") == 0) {
			ptcoef = atof(toks[2]);
				
			dsp_initlpf(&presslpf, ptcoef, PID_FREQ);
		}
		else
			goto unknown;
	}
	else if (strcmp(toks[0], "adj") == 0) {
		float v;
	
		v = atof(toks[2]);
		
		if (strcmp(toks[1], "roll") == 0)	roll0 = v;
		else if (strcmp(toks[1], "pitch") == 0)	pitch0 = v;
		else if (strcmp(toks[1], "yaw") == 0)	yaw0 = v;
		else
			goto unknown;
	}
	else
		goto unknown;

	return 0;

unknown:
	snprintf(s, INFOLEN, "Unknown command: %s\r\n", cmd);
	esp_send(&espdev, s);

	return (-1);
}

int main(void)
{
	int ms;
	int loops;
	int mss;

	HAL_Init();

